# 1. Напишите программу, которая принимает на вход вещественное число и показывает сумму его цифр.


    # num = abs(float(input("Введите число:")))
    #
    # def  sum_init (n):
    #     n *=10**5
    # sum = 0
    # while n:
    #     dig = n % 10
    #     sum = sum + dig
    #     n = n//10
    # return sum

# print("Сумма цифр равна:", int(sum_init(num)))