# # 2. Напишите программу, которая принимает на вход число N и выдает набор произведений чисел от 1 до N.
#
#
# import random
#
# def sum_init(n):
#
#
# sum: int = 1
# for i in range(1, n + 1):
#     print(int(i), end=",")
#     sum *= int(i)
# return sum
#
# num = ini(input("Введите число:"))
# print(sum_init(num))
