# # 1. Напишите программу, которая принимает на вход число N и выдаёт последовательность из N членов.

# number = int(input('ВВедие число'))
# sum = 1
# b = -3
#
# for i in range(number):
#     sum = sum * b
#     # sum *= b
#
#     print(sum, end=' ')

# 2. Создать список, длины n, значения формируются по формуле 3k + 1, где k принимает значения от 1 до n включительно.

# n = int(input('ВВедие число'))
# ls = list()
#
# for k in range(1, n+1):
#    ls.append (3*k+1)
#     print(ls)

# 3. Напишите программу, в которой пользователь будет задавать две строки, программа - определять количество вхождений одной строки в другой

str1 = str(input())
str2 = str(input())

str.count(str1)